## Staging: load_balancer
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**❌ &nbsp; Terraform Format:** `failed`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**🧹 &nbsp; Format:** run `terraform fmt` to fix the following: 
```sh
waf.tf
```
**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 3 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                  NAME                                  |
|----------|------------------------------------------------------------------------|
| update   | `aws_s3_bucket.maintenance_mode`                                       |
|          | `aws_s3_bucket_policy.allow_cloudfront_to_access_static_website_in_s3` |
|          | `aws_wafv2_web_acl.forms_maintenance_mode_acl`                         |
| recreate | `aws_wafv2_regex_pattern_set.valid_maintenance_mode_uri_paths`         |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.allow_cloudfront_to_access_static_website_in_s3 will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "allow_cloudfront_to_access_static_website_in_s3" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::gc-forms-application-maintenance-page/*",
            ]

          + principals {
              + identifiers = [
                  + "arn:aws:iam::cloudfront:user/CloudFront Origin Access Identity E2PGE1KRH6OS33",
                ]
              + type        = "AWS"
            }
        }
    }

  # aws_s3_bucket.maintenance_mode will be updated in-place
  ~ resource "aws_s3_bucket" "maintenance_mode" {
        id                          = "gc-forms-application-maintenance-page"
        tags                        = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (13 unchanged attributes hidden)

      - website {
          - index_document = "index.html" -> null
        }

        # (2 unchanged blocks hidden)
    }

  # aws_s3_bucket_policy.allow_cloudfront_to_access_static_website_in_s3 will be updated in-place
  ~ resource "aws_s3_bucket_policy" "allow_cloudfront_to_access_static_website_in_s3" {
        id     = "gc-forms-application-maintenance-page"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::cloudfront:user/CloudFront Origin Access Identity E2PGE1KRH6OS33"
                        }
                      - Resource  = "arn:aws:s3:::gc-forms-application-maintenance-page/*"
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_wafv2_regex_pattern_set.valid_maintenance_mode_uri_paths must be replaced
-/+ resource "aws_wafv2_regex_pattern_set" "valid_maintenance_mode_uri_paths" {
      ~ arn         = "arn:aws:wafv2:ca-central-1:687401027353:regional/regexpatternset/valid_maintenance_page_uri_paths/ac99eb3a-df54-4829-b015-4a83085f5993" -> (known after apply)
      ~ id          = "ac99eb3a-df54-4829-b015-4a83085f5993" -> (known after apply)
      ~ lock_token  = "14c44581-b0b9-4510-ae4f-b3fba224921a" -> (known after apply)
        name        = "valid_maintenance_page_uri_paths"
      ~ scope       = "REGIONAL" -> "CLOUDFRONT" # forces replacement
      - tags        = {} -> null
      ~ tags_all    = {} -> (known after apply)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # aws_wafv2_web_acl.forms_maintenance_mode_acl will be updated in-place
  ~ resource "aws_wafv2_web_acl" "forms_maintenance_mode_acl" {
        id         = "b200d511-5d1b-47fe-9586-e5500382f869"
        name       = "GCFormsMaintenanceMode"
        tags       = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (5 unchanged attributes hidden)

      - rule {
          - name     = "AllowGetRequestOnRootOnly" -> null
          - priority = 0 -> null

          - action {
              - allow {
                }
            }

          - statement {
              - and_statement {
                  - statement {
                      - byte_match_statement {
                          - positional_constraint = "EXACTLY" -> null
                          - search_string         = "GET" -> null

                          - field_to_match {
                              - method {}
                            }

                          - text_transformation {
                              - priority = 0 -> null
                              - type     = "NONE" -> null
                            }
                        }
                    }
                  - statement {
                      - byte_match_statement {
                          - positional_constraint = "EXACTLY" -> null
                          - search_string         = "/" -> null

                          - field_to_match {
                              - uri_path {}
                            }

                          - text_transformation {
                              - priority = 0 -> null
                              - type     = "NONE" -> null
                            }
                        }
                    }
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = false -> null
              - metric_name                = "AllowGetRequestOnRootOnly" -> null
              - sampled_requests_enabled   = false -> null
            }
        }
      + rule {
          + name     = "AllowGetOnMaintenancePageHTMLResources"
          + priority = 0

          + action {
              + allow {
                }
            }

          + statement {
              + and_statement {
                  + statement {
                      + byte_match_statement {
                          + positional_constraint = "EXACTLY"
                          + search_string         = "GET"

                          + field_to_match {
                              + method {}
                            }

                          + text_transformation {
                              + priority = 1
                              + type     = "NONE"
                            }
                        }
                    }
                  + statement {
                      + regex_pattern_set_reference_statement {
                          + arn = (known after apply)

                          + field_to_match {
                              + uri_path {}
                            }

                          + text_transformation {
                              + priority = 1
                              + type     = "COMPRESS_WHITE_SPACE"
                            }
                          + text_transformation {
                              + priority = 2
                              + type     = "LOWERCASE"
                            }
                        }
                    }
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = false
              + metric_name                = "AllowGetOnMaintenancePageHTMLResources"
              + sampled_requests_enabled   = false
            }
        }

        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 3 to change, 1 to destroy.

Warning: Argument is deprecated

  with aws_s3_bucket.firehose_waf_logs,
  on kinesis.tf line 30, in resource "aws_s3_bucket" "firehose_waf_logs":
  30: resource "aws_s3_bucket" "firehose_waf_logs" {

Use the aws_s3_bucket_lifecycle_configuration resource instead

(and 5 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_s3_bucket_object.maintenance_static_page_css_files[\"style.css\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_bucket_object.maintenance_static_page_html_files[\"index-fr.html\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_bucket_object.maintenance_static_page_html_files[\"index.html\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_bucket_object.maintenance_static_page_ico_files[\"favicon.ico\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_bucket_object.maintenance_static_page_svg_files[\"site-unavailable.svg\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_regex_pattern_set.forms_base_url"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_regex_pattern_set.valid_app_uri_paths"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_regex_pattern_set.valid_maintenance_mode_uri_paths"]

27 tests, 19 passed, 8 warnings, 0 failures, 0 exceptions

```

</details>
